update Docs and add Screenshots
